<template><div><h1 id="_2024q3规划" tabindex="-1"><a class="header-anchor" href="#_2024q3规划"><span>2024Q3规划</span></a></h1>
<blockquote>
<p>2024年7月08日——2024年9月30日</p>
</blockquote>
<p>1 读书计划</p>
<p>1.1《代码整洁之道》</p>
<p>1.2 《Googe 软件工程》</p>
<p>1.3 《重构》</p>
<p>1.4 《Vim 实用技巧》</p>
<p>1.5 《算法导论》</p>
<p>2 课程学习计划</p>
<p>2.1 学习完计算机系统结构的课程《Nand2Tetris》</p>
<p>2.2 学习完南大的24年的操作系统课，并完成相关的作业</p>
<p>3 锻炼</p>
<p>全年跑 500 km</p>
<h2 id="_2024年9月30日总结" tabindex="-1"><a class="header-anchor" href="#_2024年9月30日总结"><span>2024年9月30日总结</span></a></h2>
<p>目前已经完成大约 60% 的内容了，只能说并没有想象中的那种啃大部头的勇气（特指《算法导论》）。不过能将 Nand2Teris 的上下两门啃完（包括课程）已经算是满意的了。</p>
<p>总体而言还算一般。后续以那几本大部头为主，辅之以偶尔需要学习的编程相关知识。</p>
</div></template>


